tiborsimon/embedded-tdd-headers/pic/pic18/pic18f86j65_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC18F86J65_H_
#define _PIC18F86J65_H_

#define MISTAT                        0
#define BUSY                          1
#define SCAN                          2
#define NVALID                        3
#define EFLOCON                       4
#define FCEN0                         5
#define FCEN1                         6
#define FULDPXS                       7
#define MACON1                        8
#define MARXEN                        9
#define PASSALL                       10
#define RXPAUS                        11
#define TXPAUS                        12
#define MACON3                        13
#define FULDPX                        14
#define FRMLNEN                       15
#define HFRMEN                        16
#define PHDREN                        17
#define TXCRCEN                       18
#define PADCFG0                       19
#define PADCFG                        20
#define PADCFG1                       21
#define PADCFG2                       22
#define MACON4                        23
#define DEFER                         24
#define MABBIPG                       25
#define BBIPG0                        26
#define BBIPG1                        27
#define BBIPG2                        28
#define BBIPG3                        29
#define BBIPG4                        30
#define BBIPG5                        31
#define BBIPG6                        32
#define MICMD                         33
#define MIIRD                         34
#define MIISCAN                       35
#define ERXFCON                       36
#define BCEN                          37
#define MCEN                          38
#define HTEN                          39
#define MPEN                          40
#define PMEN                          41
#define CRCEN                         42
#define ANDOR                         43
#define UCEN                          44
#define EIE                           45
#define RXERIE                        46
#define TXERIE                        47
#define EIE_TXIE                      48
#define ETXIE                         49
#define LINKIE                        50
#define DMAIE                         51
#define PKTIE                         52
#define ESTAT                         53
#define PHYRDY                        54
#define TXABRT                        55
#define RXBUSY                        56
#define BUFER                         57
#define ECON2                         58
#define ETHEN                         59
#define PKTDEC                        60
#define AUTOINC                       61
#define EIR                           62
#define RXERIF                        63
#define TXERIF                        64
#define EIR_TXIF                      65
#define ETXIF                         66
#define LINKIF                        67
#define DMAIF                         68
#define PKTIF                         69
#define EDATA                         70
#define EDATA0                        71
#define EDATA1                        72
#define EDATA2                        73
#define EDATA3                        74
#define EDATA4                        75
#define EDATA5                        76
#define EDATA6                        77
#define EDATA7                        78
#define ECCP2DEL                      79
#define P2DC0                         80
#define ECCP2DEL_PDC0                 81
#define ECCP2DEL_PDC                  82
#define P2DC1                         83
#define ECCP2DEL_PDC1                 84
#define P2DC2                         85
#define ECCP2DEL_PDC2                 86
#define P2DC3                         87
#define ECCP2DEL_PDC3                 88
#define P2DC4                         89
#define ECCP2DEL_PDC4                 90
#define P2DC5                         91
#define ECCP2DEL_PDC5                 92
#define P2DC6                         93
#define ECCP2DEL_PDC6                 94
#define ECCP2DEL_PRSEN                95
#define P2RSEN                        96
#define ECCP2AS                       97
#define ECCP2AS_PSSBD                 98
#define ECCP2AS_PSSBD0                99
#define PSS2BD0                       100
#define ECCP2AS_PSSBD1                101
#define PSS2BD1                       102
#define PSS2AC0                       103
#define ECCP2AS_PSSAC0                104
#define ECCP2AS_PSSAC                 105
#define ECCP2AS_PSSAC1                106
#define PSS2AC1                       107
#define ECCP2AS_ECCPAS                108
#define ECCP2AS0                      109
#define ECCP2AS_ECCPAS0               110
#define ECCP2AS1                      111
#define ECCP2AS_ECCPAS1               112
#define ECCP2AS2                      113
#define ECCP2AS_ECCPAS2               114
#define ECCP2AS_ECCPASE               115
#define ECCP2ASE                      116
#define ECCP3DEL                      117
#define ECCP3DEL_PDC0                 118
#define P3DC0                         119
#define ECCP3DEL_PDC                  120
#define ECCP3DEL_PDC1                 121
#define P3DC1                         122
#define ECCP3DEL_PDC2                 123
#define P3DC2                         124
#define ECCP3DEL_PDC3                 125
#define P3DC3                         126
#define ECCP3DEL_PDC4                 127
#define P3DC4                         128
#define ECCP3DEL_PDC5                 129
#define P3DC5                         130
#define ECCP3DEL_PDC6                 131
#define P3DC6                         132
#define P3RSEN                        133
#define ECCP3DEL_PRSEN                134
#define ECCP3AS                       135
#define ECCP3AS_PSSBD0                136
#define PSS3BD0                       137
#define ECCP3AS_PSSBD                 138
#define ECCP3AS_PSSBD1                139
#define PSS3BD1                       140
#define ECCP3AS_PSSAC0                141
#define PSS3AC0                       142
#define ECCP3AS_PSSAC                 143
#define ECCP3AS_PSSAC1                144
#define PSS3AC1                       145
#define ECCP3AS_ECCPAS0               146
#define ECCP3AS_ECCPAS                147
#define ECCP3AS0                      148
#define ECCP3AS_ECCPAS1               149
#define ECCP3AS1                      150
#define ECCP3AS_ECCPAS2               151
#define ECCP3AS2                      152
#define ECCP3AS_ECCPASE               153
#define ECCP3ASE                      154
#define RCSTA2                        155
#define RCD82                         156
#define RX9D2                         157
#define RCSTA2_RCD8                   158
#define RCSTA2_RX9D                   159
#define RCSTA2_OERR                   160
#define OERR2                         161
#define FERR2                         162
#define RCSTA2_FERR                   163
#define ADDEN2                        164
#define RCSTA2_ADDEN                  165
#define RCSTA2_CREN                   166
#define CREN2                         167
#define SREN2                         168
#define RCSTA2_SREN                   169
#define RC92                          170
#define RCSTA2_nRC8                   171
#define RC8_92                        172
#define RCSTA2_RX9                    173
#define RCSTA2_NOT_RC8                174
#define RCSTA2_RC9                    175
#define RCSTA2_RC8_9                  176
#define RX92                          177
#define RCSTA2_SPEN                   178
#define SPEN2                         179
#define TXSTA2                        180
#define TXSTA2_TXD8                   181
#define TX9D2                         182
#define TXSTA2_TX9D                   183
#define TXD82                         184
#define TRMT2                         185
#define TXSTA2_TRMT                   186
#define BRGH2                         187
#define TXSTA2_BRGH                   188
#define SENDB2                        189
#define TXSTA2_SENDB                  190
#define TXSTA2_SYNC                   191
#define SYNC2                         192
#define TXEN2                         193
#define TXSTA2_TXEN                   194
#define TX8_92                        195
#define TX92                          196
#define TXSTA2_TX9                    197
#define TXSTA2_nTX8                   198
#define TXSTA2_NOT_TX8                199
#define TXSTA2_TX8_9                  200
#define TXSTA2_CSRC                   201
#define CSRC2                         202
#define CCP5CON                       203
#define CCP5M0                        204
#define CCP5M                         205
#define CCP5M1                        206
#define CCP5M2                        207
#define CCP5M3                        208
#define CCP5Y                         209
#define DC5B0                         210
#define DC5B                          211
#define CCP5X                         212
#define DC5B1                         213
#define CCP4CON                       214
#define CCP4M                         215
#define CCP4M0                        216
#define CCP4M1                        217
#define CCP4M2                        218
#define CCP4M3                        219
#define CCP4Y                         220
#define DC4B0                         221
#define DC4B                          222
#define CCP4X                         223
#define DC4B1                         224
#define T4CON                         225
#define T4CKPS0                       226
#define T4CKPS                        227
#define T4CKPS1                       228
#define TMR4ON                        229
#define T4OUTPS                       230
#define T4OUTPS0                      231
#define T4OUTPS1                      232
#define T4OUTPS2                      233
#define T4OUTPS3                      234
#define ECCP1DEL                      235
#define P1DC0                         236
#define ECCP1DEL_PDC0                 237
#define ECCP1DEL_PDC                  238
#define P1DC1                         239
#define ECCP1DEL_PDC1                 240
#define P1DC2                         241
#define ECCP1DEL_PDC2                 242
#define P1DC3                         243
#define ECCP1DEL_PDC3                 244
#define P1DC4                         245
#define ECCP1DEL_PDC4                 246
#define P1DC5                         247
#define ECCP1DEL_PDC5                 248
#define P1DC6                         249
#define ECCP1DEL_PDC6                 250
#define P1RSEN                        251
#define ECCP1DEL_PRSEN                252
#define BAUDCON2                      253
#define ABDEN2                        254
#define BAUDCON2_ABDEN                255
#define WUE2                          256
#define BAUDCON2_WUE                  257
#define BRG162                        258
#define BAUDCON2_BRG16                259
#define BAUDCON2_SCKP                 260
#define SCKP2                         261
#define TXCKP2                        262
#define BAUDCON2_TXCKP                263
#define DTRXP2                        264
#define RXDTP2                        265
#define BAUDCON2_RXDTP                266
#define RCMT2                         267
#define RCIDL2                        268
#define BAUDCON2_RCIDL                269
#define BAUDCON2_RCMT                 270
#define BAUDCON2_ABDOVF               271
#define ABDOVF2                       272
#define BAUDCON1                      273
#define BAUDCON1_ABDEN                274
#define ABDEN1                        275
#define BAUDCON1_WUE                  276
#define WUE1                          277
#define W4E                           278
#define BRG161                        279
#define BAUDCON1_BRG16                280
#define CKTXP                         281
#define BAUDCON1_TXCKP                282
#define SCKP1                         283
#define BAUDCON1_SCKP                 284
#define TXCKP1                        285
#define DTRXP1                        286
#define RXDTP1                        287
#define DTRXP                         288
#define RXCKP                         289
#define BAUDCON1_RXDTP                290
#define BAUDCON1_RCMT                 291
#define RCMT1                         292
#define RCIDL1                        293
#define BAUDCON1_RCIDL                294
#define ABDOVF1                       295
#define BAUDCON1_ABDOVF               296
#define PORTA                         297
#define ULPWUIN                       298
#define AN0                           299
#define PORTA_RA0                     300
#define LEDA                          301
#define AN1                           302
#define PORTA_RA1                     303
#define LEDB                          304
#define AN2                           305
#define PORTA_RA2                     306
#define VREFM                         307
#define AN3                           308
#define PORTA_RA3                     309
#define VREFP                         310
#define PORTA_RA4                     311
#define T0CKI                         312
#define AN4                           313
#define PORTA_RA5                     314
#define LVDIN                         315
#define RA7                           316
#define RJPU                          317
#define PORTB                         318
#define FLT0                          319
#define INT0                          320
#define PORTB_RB0                     321
#define INT1                          322
#define PORTB_RB1                     323
#define INT2                          324
#define PORTB_RB2                     325
#define INT3                          326
#define CCP2_PA2                      327
#define PORTB_RB3                     328
#define KBI0                          329
#define PORTB_RB4                     330
#define KBI1                          331
#define PORTB_RB5                     332
#define PGC                           333
#define KBI2                          334
#define PORTB_RB6                     335
#define PGD                           336
#define KBI3                          337
#define PORTB_RB7                     338
#define PORTC                         339
#define T13CKI                        340
#define T1OSO                         341
#define PORTC_RC0                     342
#define PORTC_ECCP2                   343
#define PORTC_CCP2                    344
#define T1OSI                         345
#define PA2                           346
#define PORTC_RC1                     347
#define CCP1                          348
#define ECCP1                         349
#define PA1                           350
#define PORTC_RC2                     351
#define SCK1                          352
#define SCL                           353
#define SCL1                          354
#define SCK                           355
#define PORTC_RC3                     356
#define SDI1                          357
#define SDA1                          358
#define SDA                           359
#define SDI                           360
#define PORTC_RC4                     361
#define SDO1                          362
#define SDO                           363
#define PORTC_RC5                     364
#define TX                            365
#define PORTC_RC6                     366
#define CK                            367
#define TX1                           368
#define CK1                           369
#define DT                            370
#define RX                            371
#define RX1                           372
#define DT1                           373
#define PORTC_RC7                     374
#define PORTD                         375
#define PORTD_RD0                     376
#define PORTD_RD1                     377
#define PORTD_RD2                     378
#define PORTE                         379
#define PD2                           380
#define RDE                           381
#define PORTE_RE0                     382
#define WRE                           383
#define PORTE_RE1                     384
#define PC2                           385
#define CCP10                         386
#define PB2                           387
#define CS                            388
#define PORTE_RE2                     389
#define CCP9E                         390
#define PORTE_RE3                     391
#define PC3E                          392
#define PB3E                          393
#define PORTE_RE4                     394
#define CCP8E                         395
#define CCP7E                         396
#define PORTE_RE5                     397
#define PC1E                          398
#define CCP6E                         399
#define PORTE_RE6                     400
#define PB1E                          401
#define PORTE_CCP2                    402
#define CCP2E                         403
#define PORTE_ECCP2                   404
#define PORTE_RE7                     405
#define PA2E                          406
#define PORTF                         407
#define PORTF_RF1                     408
#define C2OUTF                        409
#define AN6                           410
#define PORTF_RF2                     411
#define AN7                           412
#define C1OUTF                        413
#define PORTF_RF3                     414
#define AN8                           415
#define PORTF_RF4                     416
#define AN9                           417
#define PORTF_RF5                     418
#define CVREF                         419
#define AN10                          420
#define PORTF_RF6                     421
#define AN11                          422
#define PORTF_RF7                     423
#define SS1                           424
#define nSS1                          425
#define NOT_SS1                       426
#define nSS                           427
#define NOT_SS                        428
#define SS                            429
#define PORTG                         430
#define PORTG_RG0                     431
#define ECCP3                         432
#define CCP3                          433
#define TX2                           434
#define PORTG_RG1                     435
#define C3OUTG                        436
#define CK2                           437
#define DT2                           438
#define PORTG_RG2                     439
#define RX2                           440
#define PORTG_RG3                     441
#define CCP4                          442
#define PORTG_RG4                     443
#define CCP5                          444
#define PORTH                         445
#define PORTH_RH0                     446
#define PORTH_RH1                     447
#define PORTH_RH2                     448
#define PORTH_RH3                     449
#define PORTH_RH4                     450
#define CCP9                          451
#define PC3                           452
#define AN12                          453
#define PORTH_RH5                     454
#define CCP8                          455
#define PB3                           456
#define AN13                          457
#define PORTH_RH6                     458
#define CCP7                          459
#define PC1                           460
#define AN14                          461
#define PORTH_RH7                     462
#define CCP6                          463
#define PB1                           464
#define AN15                          465
#define PORTJ                         466
#define PORTJ_RJ4                     467
#define PORTJ_RJ5                     468
#define LATA                          469
#define LATA0                         470
#define LA0                           471
#define LATA1                         472
#define LA1                           473
#define LATA2                         474
#define LA2                           475
#define LATA3                         476
#define LA3                           477
#define LATA4                         478
#define LA4                           479
#define LATA5                         480
#define LA5                           481
#define REPU                          482
#define LA6                           483
#define LATA7                         484
#define RDPU                          485
#define LA7                           486
#define LATB                          487
#define LB0                           488
#define LATB0                         489
#define LB1                           490
#define LATB1                         491
#define LB2                           492
#define LATB2                         493
#define LB3                           494
#define LATB3                         495
#define LB4                           496
#define LATB4                         497
#define LB5                           498
#define LATB5                         499
#define LB6                           500
#define LATB6                         501
#define LB7                           502
#define LATB7                         503
#define LATC                          504
#define LATC0                         505
#define LC0                           506
#define LATC1                         507
#define LC1                           508
#define LATC2                         509
#define LC2                           510
#define LATC3                         511
#define LC3                           512
#define LATC4                         513
#define LC4                           514
#define LATC5                         515
#define LC5                           516
#define LATC6                         517
#define LC6                           518
#define LATC7                         519
#define LC7                           520
#define LATD                          521
